<a href="https://colab.research.google.com/github/Adarsh-Saurabh/Libraries-Learning/blob/Python-Libraries/Copy_of_Numpy_Pandas_Matplotlib_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Run the next cell only if you don't have `real_estate.csv` file

In [1]:
!gdown --id 1RK1l-X_f9rUTraGliCZBqqB9NRW8pABx

Downloading...
From: https://drive.google.com/uc?id=1RK1l-X_f9rUTraGliCZBqqB9NRW8pABx
To: /content/real_estate.csv
100% 22.0k/22.0k [00:00<00:00, 19.9MB/s]

# Assignment

1. Import libraries - pandas, numpy, matplotlib and seaborn
use `%matplotlib inline` also, otherwise call `plt.show()` to display charts.

In [2]:
%matplotlib inline
import pandas as pd
import numpy as np
# !pip install matplotlib
import matplotlib.pyplot as plt
plt.show()

2. Read real_estate.csv file using pandas.

In [3]:
df = pd.read_csv("real_estate.csv")

3. Display first 5 rows

In [4]:
df.head(n=5)

   No  X1 transaction date  ...  X6 longitude  Y house price of unit area
0   1             2012.917  ...     121.54024                        37.9
1   2             2012.917  ...     121.53951                        42.2
2   3             2013.583  ...     121.54391                        47.3
3   4             2013.500  ...     121.54391                        54.8
4   5             2012.833  ...     121.54245                        43.1

[5 rows x 8 columns]

4. Display last 5 rows

In [5]:
df.tail(n=5)

      No  X1 transaction date  ...  X6 longitude  Y house price of unit area
409  410             2013.000  ...     121.50381                        15.4
410  411             2012.667  ...     121.54310                        50.0
411  412             2013.250  ...     121.53986                        40.6
412  413             2013.000  ...     121.54067                        52.5
413  414             2013.500  ...     121.54310                        63.9

[5 rows x 8 columns]

5. Print number of rows and columns

In [6]:
df.shape

(414, 8)

6. Print column names

In [7]:
df.columns.values

array(['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude',
       'Y house price of unit area'], dtype=object)

7. Display 'X1 transaction date' series

In [8]:
df.iloc[0:,[0,1]]

      No  X1 transaction date
0      1             2012.917
1      2             2012.917
2      3             2013.583
3      4             2013.500
4      5             2012.833
..   ...                  ...
409  410             2013.000
410  411             2012.667
411  412             2013.250
412  413             2013.000
413  414             2013.500

[414 rows x 2 columns]

8. Display 2nd column (index=1)

In [9]:
df.iloc[1, :]

No                                           2.00000
X1 transaction date                       2012.91700
X2 house age                                19.50000
X3 distance to the nearest MRT station     306.59470
X4 number of convenience stores              9.00000
X5 latitude                                 24.98034
X6 longitude                               121.53951
Y house price of unit area                  42.20000
Name: 1, dtype: float64

9. Display columns 'X1 transaction date', 'X2 house age' only

In [10]:
df.iloc[0:,[1,2]]

     X1 transaction date  X2 house age
0               2012.917          32.0
1               2012.917          19.5
2               2013.583          13.3
3               2013.500          13.3
4               2012.833           5.0
..                   ...           ...
409             2013.000          13.7
410             2012.667           5.6
411             2013.250          18.8
412             2013.000           8.1
413             2013.500           6.5

[414 rows x 2 columns]

10. Create a new column `built_in` and it's values should be 
`X1 transaction date` - `X2 house age`

In [11]:
##  Subtracting the columns

built_in = df['X1 transaction date']  - df['X2 house age']
##  Now addin the new column
df['Built_in'] = built_in

df

      No  X1 transaction date  ...  Y house price of unit area  Built_in
0      1             2012.917  ...                        37.9  1980.917
1      2             2012.917  ...                        42.2  1993.417
2      3             2013.583  ...                        47.3  2000.283
3      4             2013.500  ...                        54.8  2000.200
4      5             2012.833  ...                        43.1  2007.833
..   ...                  ...  ...                         ...       ...
409  410             2013.000  ...                        15.4  1999.300
410  411             2012.667  ...                        50.0  2007.067
411  412             2013.250  ...                        40.6  1994.450
412  413             2013.000  ...                        52.5  2004.900
413  414             2013.500  ...                        63.9  2007.000

[414 rows x 9 columns]

11. How many houses have 5 convenience stores near them?

In [12]:
# for full list
x  =  df.iloc[:,[4]]
value_counts

In [13]:
# for number of houses having 5 convenience stores near them

12. Draw a bar chart to show convenicene stores to no. of houses

13. Draw piechart for same data

14. Draw histogram on `built_in` column

15. Get the data of houses where house age is greater than 15

16. Get the data of houses with 9 convenience stores.

17. Get the data of houses with even number of convenience stores.

18. Get data of houses 20-40

19. Get all houses built in year 1996

20. Draw a scatter plot for two columns (x and y) - X3 distance to the nearest MRT station and Y house price of unit area

21. Replace X4 number of convenience stores 0 values with 1

22. Create a numpy array with values 1 to 100

23. Add 2 to all elements

24. Get 5th element

25. Get 6th element to 20th element

26. Create a random numpy array (in range 40 - 50) of size (10)

27. Create a random matrix of size (4,4) (values should range 2 - 30)

28. Get all odd numbers from above matrix

29. Get 3rd row

30. Get 2nd column

31. Get 1-2 row and 2-3 column data

32. Replace 1-2 row and 2-3 column data with 1

33. Draw pairplot of csv file